; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=58, out_folder=htg/blocksworld//training, instance_id=38, seed=2062

(define (problem blocksworld-38)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 - object)
 (:init 
    (arm-empty)
    (clear b7)
    (on b7 b45)
    (on-table b45)
    (clear b53)
    (on b53 b23)
    (on b23 b32)
    (on b32 b43)
    (on b43 b15)
    (on b15 b3)
    (on-table b3)
    (clear b28)
    (on b28 b12)
    (on b12 b19)
    (on b19 b25)
    (on b25 b20)
    (on b20 b31)
    (on b31 b38)
    (on b38 b8)
    (on b8 b18)
    (on b18 b6)
    (on b6 b26)
    (on b26 b13)
    (on b13 b52)
    (on b52 b21)
    (on b21 b39)
    (on b39 b44)
    (on b44 b42)
    (on b42 b27)
    (on b27 b5)
    (on b5 b9)
    (on b9 b16)
    (on-table b16)
    (clear b46)
    (on b46 b50)
    (on-table b50)
    (clear b33)
    (on b33 b14)
    (on b14 b56)
    (on b56 b36)
    (on b36 b41)
    (on b41 b17)
    (on b17 b1)
    (on b1 b4)
    (on b4 b37)
    (on b37 b30)
    (on b30 b10)
    (on b10 b24)
    (on b24 b58)
    (on-table b58)
    (clear b49)
    (on b49 b35)
    (on b35 b2)
    (on b2 b55)
    (on b55 b54)
    (on b54 b11)
    (on b11 b48)
    (on b48 b47)
    (on b47 b51)
    (on b51 b34)
    (on b34 b29)
    (on b29 b40)
    (on-table b40)
    (clear b22)
    (on b22 b57)
    (on-table b57))
 (:goal  (and 
    (clear b1)
    (on b1 b4)
    (on-table b4)
    (clear b3)
    (on b3 b5)
    (on b5 b2)
    (on-table b2))))

; plan
1. (unstack b49 b35)
   deleted: (on b49 b35) (clear b49) (arm-empty)
   added: (holding b49) (clear b35)
   goals met: 1 of 7
2. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 1 of 7
3. (unstack b35 b2)
   deleted: (on b35 b2) (clear b35) (arm-empty)
   added: (holding b35) (clear b2)
   goals met: 1 of 7
4. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 1 of 7
5. (unstack b2 b55)
   deleted: (on b2 b55) (clear b2) (arm-empty)
   added: (holding b2) (clear b55)
   goals met: 1 of 7
6. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 7
7. (unstack b53 b23)
   deleted: (on b53 b23) (clear b53) (arm-empty)
   added: (holding b53) (clear b23)
   goals met: 2 of 7
8. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 2 of 7
9. (unstack b23 b32)
   deleted: (on b23 b32) (clear b23) (arm-empty)
   added: (holding b23) (clear b32)
   goals met: 2 of 7
10. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 2 of 7
11. (unstack b32 b43)
   deleted: (on b32 b43) (clear b32) (arm-empty)
   added: (holding b32) (clear b43)
   goals met: 2 of 7
12. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 2 of 7
13. (unstack b43 b15)
   deleted: (on b43 b15) (clear b43) (arm-empty)
   added: (holding b43) (clear b15)
   goals met: 2 of 7
14. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 2 of 7
15. (unstack b15 b3)
   deleted: (on b15 b3) (clear b15) (arm-empty)
   added: (holding b15) (clear b3)
   goals met: 3 of 7
16. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 7
17. (unstack b33 b14)
   deleted: (on b33 b14) (clear b33) (arm-empty)
   added: (holding b33) (clear b14)
   goals met: 3 of 7
18. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 3 of 7
19. (unstack b14 b56)
   deleted: (on b14 b56) (clear b14) (arm-empty)
   added: (holding b14) (clear b56)
   goals met: 3 of 7
20. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 3 of 7
21. (unstack b56 b36)
   deleted: (on b56 b36) (clear b56) (arm-empty)
   added: (holding b56) (clear b36)
   goals met: 3 of 7
22. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 3 of 7
23. (unstack b36 b41)
   deleted: (on b36 b41) (clear b36) (arm-empty)
   added: (holding b36) (clear b41)
   goals met: 3 of 7
24. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 3 of 7
25. (unstack b41 b17)
   deleted: (on b41 b17) (clear b41) (arm-empty)
   added: (holding b41) (clear b17)
   goals met: 3 of 7
26. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 3 of 7
27. (unstack b17 b1)
   deleted: (on b17 b1) (clear b17) (arm-empty)
   added: (holding b17) (clear b1)
   goals met: 4 of 7
28. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 4 of 7
29. (unstack b28 b12)
   deleted: (on b28 b12) (clear b28) (arm-empty)
   added: (holding b28) (clear b12)
   goals met: 4 of 7
30. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 4 of 7
31. (unstack b12 b19)
   deleted: (on b12 b19) (clear b12) (arm-empty)
   added: (holding b12) (clear b19)
   goals met: 4 of 7
32. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 7
33. (unstack b19 b25)
   deleted: (on b19 b25) (clear b19) (arm-empty)
   added: (holding b19) (clear b25)
   goals met: 4 of 7
34. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 4 of 7
35. (unstack b25 b20)
   deleted: (on b25 b20) (clear b25) (arm-empty)
   added: (holding b25) (clear b20)
   goals met: 4 of 7
36. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 7
37. (unstack b20 b31)
   deleted: (on b20 b31) (clear b20) (arm-empty)
   added: (holding b20) (clear b31)
   goals met: 4 of 7
38. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 4 of 7
39. (unstack b31 b38)
   deleted: (on b31 b38) (clear b31) (arm-empty)
   added: (holding b31) (clear b38)
   goals met: 4 of 7
40. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 4 of 7
41. (unstack b38 b8)
   deleted: (on b38 b8) (clear b38) (arm-empty)
   added: (holding b38) (clear b8)
   goals met: 4 of 7
42. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 4 of 7
43. (unstack b8 b18)
   deleted: (on b8 b18) (clear b8) (arm-empty)
   added: (holding b8) (clear b18)
   goals met: 4 of 7
44. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 4 of 7
45. (unstack b18 b6)
   deleted: (on b18 b6) (clear b18) (arm-empty)
   added: (holding b18) (clear b6)
   goals met: 4 of 7
46. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 4 of 7
47. (unstack b6 b26)
   deleted: (on b6 b26) (clear b6) (arm-empty)
   added: (holding b6) (clear b26)
   goals met: 4 of 7
48. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 4 of 7
49. (unstack b26 b13)
   deleted: (on b26 b13) (clear b26) (arm-empty)
   added: (holding b26) (clear b13)
   goals met: 4 of 7
50. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 4 of 7
51. (unstack b13 b52)
   deleted: (on b13 b52) (clear b13) (arm-empty)
   added: (holding b13) (clear b52)
   goals met: 4 of 7
52. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 4 of 7
53. (unstack b52 b21)
   deleted: (on b52 b21) (clear b52) (arm-empty)
   added: (holding b52) (clear b21)
   goals met: 4 of 7
54. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 4 of 7
55. (unstack b21 b39)
   deleted: (on b21 b39) (clear b21) (arm-empty)
   added: (holding b21) (clear b39)
   goals met: 4 of 7
56. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 4 of 7
57. (unstack b39 b44)
   deleted: (on b39 b44) (clear b39) (arm-empty)
   added: (holding b39) (clear b44)
   goals met: 4 of 7
58. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 4 of 7
59. (unstack b44 b42)
   deleted: (on b44 b42) (clear b44) (arm-empty)
   added: (holding b44) (clear b42)
   goals met: 4 of 7
60. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 4 of 7
61. (unstack b42 b27)
   deleted: (on b42 b27) (clear b42) (arm-empty)
   added: (holding b42) (clear b27)
   goals met: 4 of 7
62. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 4 of 7
63. (unstack b27 b5)
   deleted: (on b27 b5) (clear b27) (arm-empty)
   added: (holding b27) (clear b5)
   goals met: 4 of 7
64. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 4 of 7
65. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 4 of 7
66. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 5 of 7
67. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 4 of 7
68. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 6 of 7
69. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 4 of 7
70. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 7
71. (unstack b4 b37)
   deleted: (on b4 b37) (clear b4) (arm-empty)
   added: (holding b4) (clear b37)
   goals met: 5 of 7
72. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 7
73. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 7
74. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 7 of 7
